#include <windows.h>

int kabaddi(int *output1, int *output2, int input1, int input2){


	int keydata1[30][2] = {

			{ 1<<0, 0x25},//左キー
			{ 1<<1, 0x26},//上キー
			{ 1<<2, 0x27},//右キー
			{ 1<<3, 0x28},//下キー
			{ 1<<4, 0x20},//スペース
			{ 1<<5, 0x0D},//エンターキー
			{ 1<<6, 0x11},//コントロールキー
			{ 1<<7, 0x01},//左クリック
			{ 1<<8, 0x02},//右クリック
			{ 1<<9, 0x09},//TAB

			{ 1<<10, 0x41},//Aキー
			{ 1<<11, 0x42},//Bキー
			{ 1<<12, 0x43},//Cキー
			{ 1<<13, 0x44},//Dキー
			{ 1<<14, 0x45},//Eキー
			{ 1<<15, 0x46},//Fキー
			{ 1<<16, 0x47},//Gキー
			{ 1<<17, 0x48},//Hキー
			{ 1<<18, 0x49},//Iキー
			{ 1<<19, 0x4A},//Jキー
			{ 1<<20, 0x4B},//Kキー
			{ 1<<21, 0x4C},//Lキー
			{ 1<<22, 0x4D},//Mキー
			{ 1<<23, 0x4E},//Nキー
			{ 1<<24, 0x4F},//Oキー
			{ 1<<25, 0x50},//Pキー
			{ 1<<26, 0x51},//Qキー
			{ 1<<27, 0x52},//Rキー
			{ 1<<28, 0x53},//Sキー
			{ 1<<29, 0x54},//Tキー
		};

	int keydata2[30][2] ={

			{ 1<<0, 0x55},//Uキー
			{ 1<<1, 0x56},//Vキー
			{ 1<<2, 0x57},//Wキー
			{ 1<<3, 0x58},//Xキー
			{ 1<<4, 0x59},//Yキー
			{ 1<<5, 0x5A},//Zキー

			{ 1<<6, 0x30},//メイン1キー
			{ 1<<7, 0x31},//メイン2キー
			{ 1<<8, 0x32},//メイン3キー
			{ 1<<9, 0x33},//メイン4キー
			{ 1<<10, 0x34},//メイン5キー
			{ 1<<11, 0x35},//メイン6キー
			{ 1<<12, 0x36},//メイン7キー
			{ 1<<13, 0x37},//メイン7キー
			{ 1<<14, 0x38},//メイン8キー
			{ 1<<15, 0x39},//メイン9キー

			{ 1<<16, 0x1B},//ESCキー
			{ 1<<17, 0x04},//マウス真ん中
			{ 1<<18, 0x10},//シフトキー
			{ 1<<19, 0x08},//バックスペース
			{ 1<<20, 0x12},//ALTキー
			{ 1<<21, 0x09},//TABキー
			{ 1<<22, 0x70},//F1
			{ 1<<23, 0x71},//F2

			{ 1<<24, 0x72},//F3
			{ 1<<25, 0x73},//F4
			{ 1<<26, 0x74},//F5
			{ 1<<27, 0x75},//F6
			{ 1<<28, 0x76},//F7
			{ 1<<29, 0x77},//F8
		};

	//0.トリガーキーか？::1.前回押されたか
	static int keyBox1[30][2];
	static int keyBox2[30][2];
	*output1 = 0;
	*output2 = 0;
	int i = 0;

	while(i <= 30){
				
				//初期化
				keyBox2[i][0] = 0;


				if(input1 & (1<<i)){//もし、トリガーありなら
									keyBox1[i][0] = 1;
				};
				if(input2 & (1<<i)){//もし、トリガーありなら
									keyBox2[i][0] = 1;
				};

				//キー押し判定
				if(GetAsyncKeyState(keydata1[i][1]) & 0x8000){//キーが押されていたら
													*output1 = *output1 + keydata1[i][0];
													if((keyBox1[i][0] == 0) && (keyBox1[i][1] == 1)){
																						*output1 = *output1 - keydata1[i][0];		
													}
													keyBox1[i][1] = 1; 
				}
				else{
						keyBox1[i][1] = 0; 
				}

				if(GetAsyncKeyState(keydata2[i][1]) & 0x8000){//キーが押されていたら
													*output2 = *output2 + keydata2[i][0];
													if((keyBox2[i][0] == 0) && (keyBox2[i][1] == 1)){
																						*output2 = *output2 - keydata2[i][0];
													}
													keyBox2[i][1] = 1; 
				}
				else{
						keyBox2[i][1] = 0; 
				}

				i++;

	};
	i = 0;





	return 0;
}